//Lesson№10.Учимся работать с системой контроля версий Git и сервисом GitHub
"use strict";


//Lesson№11.Как работать с GitHub c разных компьютеров,gitignore и Git Kraken
//нам нужно скопировать клон репозитория с которым я работаю с удаленного компьютера

//Кликаем в github на нужном репозитории в аккаунте clone or donwload
//мы ее нажимаем и первое мы можем скачать zip архив разархивировать и уже работать с этим репозиторием
//второе мы можем воспользоватся терминалом и запустить такую команду которая называется
//git clone для того чтобы склонировать себе этот репозиторий локально на компьютер
//воспользуемся более правильным вариантом с командой терминала,скопируем оттуда ссылку
//https://github.com/Artyr9292/artei.git это путь по которому мне можно найти этот репозиторий

//если вы работаете в vs code мне необходимо перейти в другую папку рабочую(work) для этого
//я сначала выйду с нее прописав команду в терминале cd..
//а потом зайду в нашу папку которая называется work 
//прописав команду cd work
//получается мы зашли в нашу папку work(где у нас удаленный компьютер на котором мы работаем,
//допустим что мы здесь на работе)

//я прописываю git clone и вставляю тот путь репозитория который я скопировал
//git clone https://github.com/Artyr9292/artei.git/project_2
//и дальше мне надо написать название папки куда это все будет складываться
//допустим это будет папка project_2 все у нас начинается операция клонирования все
//файлы которые были в репозитории у нас клонируются в определенный проект
//

